
#Область ПрограммныйИнтерфейс
 Процедура ДополнитьФорму(Форма) Экспорт
 	
 	ИмяФормы = Форма.ИМяФормы;
 	
 	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда 
 		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
 		ДобавитьПолеСогласованнаяСкидкаВГруппаСкидка(Форма);
 	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда 
 		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
  	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда 
 		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
  		ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда 
 		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
  	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда 
 		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
 	КонецЕсли;
 	
 	КонецПроцедуры
 	
#КонецОбласти 
  
#Область СлужебныеПроцедурыИФункции
  
Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
 	
 	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо",Тип("ПолеФормы"),Форма.Элементы.ГруппаШапкаПраво);
 	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
 	ПолеВвода.ПутьКДанным = "Объект.КонтактноеЛицо";
 			
КонецПроцедуры

Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
 	
 	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо",Тип("ПолеФормы"),,Форма.Элементы.СуммаДокумента);
 	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
 	ПолеВвода.ПутьКДанным = "Объект.КонтактноеЛицо";
 			
КонецПроцедуры
 
Процедура ДобавитьПолеСогласованнаяСкидкаВГруппаСкидка(Форма);
 	
 ГруппаФормы = Форма.Элементы.Добавить("ГруппаСкидка",Тип("ГруппаФормы"),Форма.Элементы.ГруппаШапкаЛево);
	ГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
 
	// Добавление реквизита на форму
	ПолеВвода = Форма.Элементы.Добавить("СогласованнаяCкидка",Тип("ПолеФормы"),ГруппаФормы);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.СогласованнаяCкидка";
	ПолеВвода.УстановитьДействие("ПриИзменении","СогласованнаяCкидкаПриИзменении");
	
	ДобавитьКнопкуПрименитьСкидку( Форма,ГруппаФормы);
КонецПроцедуры
 
Процедура ДобавитьКнопкуПрименитьСкидку(Форма,ГруппаФормы)
	// {{ feoktistov:Добавление команды формы
	КомандаПрименитьСкидку = Форма.Команды.Добавить("ПрименитьСкидку");
	КомандаПрименитьСкидку.Заголовок = "ПрименитьСкидку";
	КомандаПрименитьСкидку.Действие ="КомандаПрименитьСкидкуНажатие";
	
	// {{ feoktistov:Добавление кнопки команды на форму
	Кнопка = Форма.Элементы.Добавить("кнопкаПрименитьСкидку",Тип("КнопкаФормы"),ГруппаФормы);
	Кнопка.ИмяКоманды = "ПрименитьСкидку";
	Кнопка.Вид  = ВидКнопкиФормы.ОбычнаяКнопка;
 КонецПроцедуры
 

 
 
 
#КонецОбласти 
  